Revit 2027 API
Document.IsModified Property
 The state of changes made to the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsModified { get; }
Public ReadOnly Property IsModified As Boolean
	Get
public:
property bool IsModified {
	bool get ();
}
member IsModified : bool with get
Property Value
Boolean
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace